cf/DataProcessors/бпсНастройкиСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<DataProcessor>
		<Properties>
			<Name>бпсНастройкиСогласования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧНастройкиПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУведомлятьОЗадачахПочтой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДПользователяТелеграмм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧРегистрАдресации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсРолиАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсПодразделенияАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/бпсНастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<InformationRegister>
		<Properties>
			<Name>бпсНастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеУведомлятьОЗадачахПочтой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДПользователяТелеграмм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/бпсРегистрАдресации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<InformationRegister>
		<Properties>
			<Name>бпсРегистрАдресации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольАдресации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсРолиАдресации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеАдресации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПодразделенияАдресации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/бпсПредметыСогласований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<Catalog>
		<Properties>
			<Name>бпсПредметыСогласований</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсТипыОбъектовБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрощеннаяСистемаУведомлений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьИнициатораОЗавершении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПовторноеСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПроведениеОбъектаБДПокаОнНеСогласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользованиеОбъектаБДПокаОнНеСогласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОпределениеЛистаСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсРолиАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсПодразделенияАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУвеличиватьНомерОчереди</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПользователиДляУведомления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бпсСобытия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлятьПочтой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлятьЗадачей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бпсСобытия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бпсДействия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/бпсНастройкиСогласования/Ext/ObjectModule.bsl
Процедура ЗаполнитьАвто() Экспорт
	ЗаполнитьТЧНастройкиПользователей();
	ЗаполнитьТЧРегистрАдресации();
КонецПроцедуры 

Процедура ЗаполнитьТЧНастройкиПользователей() Экспорт
	ТЧНастройкиПользователей.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	бпсНастройкиПользователей.АдресЭлектроннойПочты,
	|	бпсНастройкиПользователей.НеУведомлятьОЗадачахПочтой
	|ИЗ
	//|	Справочник.Пользователи КАК Пользователи
	|	Справочник.Users КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бпсНастройкиПользователей КАК бпсНастройкиПользователей
	|		ПО Пользователи.Ссылка = бпсНастройкиПользователей.Пользователь
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И (бпсНастройкиПользователей.АдресЭлектроннойПочты ЕСТЬ NULL 
	|			ИЛИ бпсНастройкиПользователей.АдресЭлектроннойПочты = """")
	|	И (бпсНастройкиПользователей.НеУведомлятьОЗадачахПочтой ЕСТЬ NULL 
	|		ИЛИ бпсНастройкиПользователей.НеУведомлятьОЗадачахПочтой = ЛОЖЬ)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаТЧНастройкиПользователей=ТЧНастройкиПользователей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧНастройкиПользователей,Выборка);
			СтрокаТЧНастройкиПользователей.Пометка = Истина;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры 

Процедура ЗаполнитьТЧРегистрАдресации() Экспорт
	ТЧРегистрАдресации.Очистить();
	Если ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователи Тогда
		ЗаполнитьТЧРегистрАдресацииПолучитьНезаполненныеПары();	
	Иначе
	 	Если ЗначениеЗаполнено(ПредметСогласования) Тогда
			ЗаполнитьТЧРегистрАдресацииПоПредметуСогласования();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = NStr("ru = 'Заполните предмет согласования'");
			Сообщение.Поле = "Объект.ПредметСогласования";
			Сообщение.Сообщить();
		Конецесли;
	Конецесли;
КонецПроцедуры 

Процедура ЗаполнитьТЧРегистрАдресацииПолучитьНезаполненныеПары() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.РольАдресации,
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.ПодразделениеАдресации
	|ПОМЕСТИТЬ ВТРолиИПодразделения
	|ИЗ
	|	Справочник.бпсПредметыСогласований.ОпределениеЛистаСогласования КАК бпсПредметыСогласованийОпределениеЛистаСогласования
	|ГДЕ
	|	НЕ бпсПредметыСогласованийОпределениеЛистаСогласования.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бпсЗадача.РольАдресации,
	|	бпсЗадача.ПодразделениеАдресации
	|ИЗ
	|	Задача.бпсЗадача КАК бпсЗадача
	|ГДЕ
	|	НЕ бпсЗадача.Выполнена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бпсРегистрАдресации.РольАдресации,
	|	бпсРегистрАдресации.ПодразделениеАдресации
	|ПОМЕСТИТЬ ВТРегистрАдресации
	|ИЗ
	|	РегистрСведений.бпсРегистрАдресации КАК бпсРегистрАдресации
	|ГДЕ
	|	(бпсРегистрАдресации.РольАдресации, бпсРегистрАдресации.ПодразделениеАдресации) В
	|			(ВЫБРАТЬ
	|				ВТРолиИПодразделения.РольАдресации,
	|				ВТРолиИПодразделения.ПодразделениеАдресации
	|			ИЗ
	|				ВТРолиИПодразделения)
	//|	И бпсРегистрАдресации.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И бпсРегистрАдресации.Пользователь <> ЗНАЧЕНИЕ(Справочник.Users.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРолиИПодразделения.РольАдресации,
	|	ВТРолиИПодразделения.ПодразделениеАдресации
	|ИЗ
	|	ВТРолиИПодразделения КАК ВТРолиИПодразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистрАдресации КАК ВТРегистрАдресации
	|		ПО ВТРолиИПодразделения.РольАдресации = ВТРегистрАдресации.РольАдресации
	|			И ВТРолиИПодразделения.ПодразделениеАдресации = ВТРегистрАдресации.ПодразделениеАдресации
	|ГДЕ
	|	(ВТРегистрАдресации.РольАдресации ЕСТЬ NULL 
	|			ИЛИ ВТРегистрАдресации.ПодразделениеАдресации ЕСТЬ NULL )";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда		
		Возврат;
	Конецесли;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧРегистрАдресации = ТЧРегистрАдресации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧРегистрАдресации,Выборка);
		СтрокаТЧРегистрАдресации.Пометка = Истина;
	КонецЦикла;		
КонецПроцедуры 

Процедура ЗаполнитьТЧРегистрАдресацииПоПредметуСогласования() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.НомерСтроки КАК Очередь,
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.РольАдресации,
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.ПодразделениеАдресации
	|ПОМЕСТИТЬ ВТРолиИПодразделения
	|ИЗ
	|	Справочник.бпсПредметыСогласований.ОпределениеЛистаСогласования КАК бпсПредметыСогласованийОпределениеЛистаСогласования
	|ГДЕ
	|	бпсПредметыСогласованийОпределениеЛистаСогласования.Ссылка = &ПредметСогласования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бпсРегистрАдресации.Пользователь,
	|	бпсРегистрАдресации.РольАдресации,
	|	бпсРегистрАдресации.ПодразделениеАдресации
	|ПОМЕСТИТЬ ВТРегистрАдресации
	|ИЗ
	|	РегистрСведений.бпсРегистрАдресации КАК бпсРегистрАдресации
	|ГДЕ
	|	(бпсРегистрАдресации.РольАдресации, бпсРегистрАдресации.ПодразделениеАдресации) В
	|			(ВЫБРАТЬ
	|				ВТРолиИПодразделения.РольАдресации,
	|				ВТРолиИПодразделения.ПодразделениеАдресации
	|			ИЗ
	|				ВТРолиИПодразделения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРолиИПодразделения.Очередь КАК Очередь,
	|	ВТРегистрАдресации.Пользователь,
	|	ВТРолиИПодразделения.РольАдресации,
	|	ВТРолиИПодразделения.ПодразделениеАдресации
	|ИЗ
	|	ВТРолиИПодразделения КАК ВТРолиИПодразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистрАдресации КАК ВТРегистрАдресации
	|		ПО ВТРолиИПодразделения.РольАдресации = ВТРегистрАдресации.РольАдресации
	|			И ВТРолиИПодразделения.ПодразделениеАдресации = ВТРегистрАдресации.ПодразделениеАдресации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очередь";

	Запрос.УстановитьПараметр("ПредметСогласования",ПредметСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда		
		Возврат;
	Конецесли;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧРегистрАдресации = ТЧРегистрАдресации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧРегистрАдресации,Выборка);
		СтрокаТЧРегистрАдресации.Пометка = Ложь;
	КонецЦикла;		
КонецПроцедуры 

Процедура СформироватьЗаписиВРегистрАдресации() Экспорт
	Для каждого СтрокаТЧРегистрАдресации из ТЧРегистрАдресации цикл
		Если НЕ СтрокаТЧРегистрАдресации.Пометка Тогда
			Продолжить;
		Конецесли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧРегистрАдресации.Пользователь) Тогда
			Сообщить(NStr("ru = 'Ошибка! Необходимо заполнить Пользователя в строке '") + СтрокаТЧРегистрАдресации.НомерСтроки);
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧРегистрАдресации.РольАдресации) Тогда
			Сообщить(NStr("ru = 'Ошибка! Необходимо заполнить РольАдресации в строке '") + СтрокаТЧРегистрАдресации.НомерСтроки);
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧРегистрАдресации.ПодразделениеАдресации) Тогда
			Сообщить(NStr("ru = 'Ошибка! Необходимо заполнить ПодразделениеАдресации в строке '") + СтрокаТЧРегистрАдресации.НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.бпсРегистрАдресации.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Пользователь = СтрокаТЧРегистрАдресации.Пользователь;
		МенеджерЗаписи.РольАдресации = СтрокаТЧРегистрАдресации.РольАдресации;
		МенеджерЗаписи.ПодразделениеАдресации = СтрокаТЧРегистрАдресации.ПодразделениеАдресации;
		МенеджерЗаписи.Записать();
		Сообщить(StrTemplate(NStr("ru = 'Сохранена настройка для
                                   |Пользователь [%1]
                                   |РольАдресации [%2]
                                   |ПодразделениеАдресации [%3]'"), 
						СтрокаТЧРегистрАдресации.Пользователь, 
						СтрокаТЧРегистрАдресации.РольАдресации, 
						СтрокаТЧРегистрАдресации.ПодразделениеАдресации));
	Конеццикла;
КонецПроцедуры 

Процедура СформироватьЗаписиНастройкиПользователей() Экспорт
	Для каждого СтрокаТЧНастройкиПользователей из ТЧНастройкиПользователей цикл
		Если НЕ СтрокаТЧНастройкиПользователей.Пометка Тогда
			Продолжить;
		Конецесли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧНастройкиПользователей.Пользователь) Тогда
			Сообщить(NStr("ru = 'Ошибка! Необходимо заполнить Пользователя в строке '") +
				СтрокаТЧНастройкиПользователей.НомерСтроки);
			Продолжить;
		КонецЕсли;
		Если НЕ СтрокаТЧНастройкиПользователей.НеУведомлятьОЗадачахПочтой
			И НЕ ЗначениеЗаполнено(СтрокаТЧНастройкиПользователей.АдресЭлектроннойПочты) Тогда
			Сообщить(NStr("ru = 'Ошибка! Необходимо заполнить АдресЭлектроннойПочты в строке '") +
				СтрокаТЧНастройкиПользователей.НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.бпсНастройкиПользователей.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Пользователь = СтрокаТЧНастройкиПользователей.Пользователь;
		МенеджерЗаписи.АдресЭлектроннойПочты = СтрокаТЧНастройкиПользователей.АдресЭлектроннойПочты;
		МенеджерЗаписи.НеУведомлятьОЗадачахПочтой = СтрокаТЧНастройкиПользователей.НеУведомлятьОЗадачахПочтой;
		МенеджерЗаписи.ИДПользователяТелеграмм = СтрокаТЧНастройкиПользователей.ИДПользователяТелеграмм;
		МенеджерЗаписи.Записать();
		Сообщить(StrTemplate(NStr("ru = 'Сохранена настройка для
                                   |Пользователь [%1]
                                   |АдресЭлектроннойПочты [%2]
                                   |НеУведомлятьОЗадачахПочтой [%3]
                                   |ИДПользователяТелеграмм [%4]'"), СтрокаТЧНастройкиПользователей.Пользователь, 
			СтрокаТЧНастройкиПользователей.АдресЭлектроннойПочты,
			СтрокаТЧНастройкиПользователей.НеУведомлятьОЗадачахПочтой,
			СтрокаТЧНастройкиПользователей.ИДПользователяТелеграмм));
	Конеццикла;

КонецПроцедуры
